app/Controllers/KategoriKost.php

SELECT *
FROM `kategori_kost`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `kategori_kost`
---
    public function index()
    {
        $model = new KategoriKostModel();

        $data['kategoriKost'] = $model->paginate(5);