app/Controllers/Kost.php

SELECT COUNT(*) AS `numrows`
FROM `kost`
JOIN `kategori_kost` ON `kategori_kost`.`id_kategori` = `kost`.`id_kategori`
SELECT `kost`.*, `kategori_kost`.`nama_kategori`
FROM `kost`
JOIN `kategori_kost` ON `kategori_kost`.`id_kategori` = `kost`.`id_kategori`
 LIMIT 5
---
    public function index()
    {
        $model = new KostModel();

        $data['kost'] = $model
            ->select('kost.*, kategori_kost.nama_kategori')
            ->join(
                'kategori_kost',
                'kategori_kost.id_kategori = kost.id_kategori'
            )
            ->paginate(5);

SELECT *
FROM `kategori_kost`
---
    public function create()
    {
        $model = new KategoriKostModel();
        $data['kategori'] = $model->findAll();

INSERT INTO `kost` (`id_kategori`, `nama_kost`, `alamat`, `harga`, `jarak`, `fasilitas`, `keamanan`, `wifi`, `ukuran_kamar`, `status`, `foto`) VALUES ('3', 'Kost Biree', 'Blang Pulo', '620000', '2', 'Kasur,Lemari,Kamar mandi Dalam', '3', 'Tidak', '3x3', 'Tersedia', '1785780439_c90ae2ef4ca83ff5edb6.jpg')
---
        $file->move('uploads', $namaBaru);
        $fasilitas = implode(',', $this->request->getPost('fasilitas'));

        $model->save([
            'id_kategori' => $this->request->getPost('id_kategori'),
            'nama_kost' => $this->request->getPost('nama_kost'),
            'alamat' => $this->request->getPost('alamat'),
            'harga' => $this->request->getPost('harga'),
            'jarak' => $this->request->getPost('jarak'),
            'fasilitas' => $fasilitas,
            'keamanan' => $this->request->getPost('keamanan'),
            'wifi' => $this->request->getPost('wifi'),
            'ukuran_kamar' => $this->request->getPost('ukuran_kamar'),
            'status' => $this->request->getPost('status'),
            'foto' => $namaBaru

        ]);

SELECT *
FROM `kategori_kost`
---
    public function edit($id)
    {
        helper('form');
        $model = new KostModel();
        $Kostmodel = new KategoriKostModel();
        $data['kategori'] = $Kostmodel->findAll();

SELECT *
FROM `kost`
WHERE `kost`.`id_kost` = '1'
DELETE FROM `nilai_alternatif`
WHERE `id_kost` = '1'
SELECT *
FROM `kriteria`
---
    private function sinkronNilaiAlternatif($idKost)
    {
        $kostModel = new KostModel();
        $kriteriaModel = new KriteriaModel();
        $nilaiModel = new NilaiAlternatifModel();

        $kost = $kostModel->find($idKost);

        $nilaiModel->where('id_kost', $idKost)->delete();

        $kriteria = $kriteriaModel->findAll();