app/Controllers/Kriteria.php

    public function index()
    {
        $model = new KriteriaModel();

        $data['kriteria'] = $model->paginate(5,'kriteria');
---
SELECT *
FROM `kriteria`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `kriteria`