app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `nama` = 'admin'
 LIMIT 1
---
    public function authenticate()
    {
        $model = new UserModel();
        $rules = [
            'nama' => [
                'rules' => 'required',
                'errors' => [
                    'required' => ' Nama Wajib diisi',
                ]
            ],
            'password' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Password harus diisi',
                ]
            ],
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput();
        }

        $nama = $this->request->getPost('nama');
        $password = $this->request->getPost('password');

        $user = $model->where('nama', $nama)->first();