app/Controllers/Rekomendasi.php

SELECT *
FROM `kriteria`
---
    public function index()
    {
        helper('form');

        $kriteriaModel = new KriteriaModel();

        $data['kriteria'] = $kriteriaModel->findAll();